# Taps
tap "homebrew/bundle"

# Development tools
brew "git"
brew "tmux"
brew "vim"
brew "zsh"
brew "node"
brew "python"

# CLI tools
brew "tree"
brew "wget"
brew "htop"
brew "jq"
brew "bat"      # Better cat with syntax highlighting
brew "fd"       # Better find
brew "eza"      # Better ls (maintained fork of exa)

# Search & navigation
brew "gh"       # GitHub CLI
brew "fzf"      # Fuzzy finder
brew "ripgrep"  # Fast search tool

# Python development
cask "miniconda"

# Applications
cask "visual-studio-code-insiders"  # Primary editor
cask "visual-studio-code"           # Backup editor
cask "docker"
