tap "azure/azd"

# Development tools
brew "git"
brew "git-lfs"          # Git Large File Storage
brew "git-gui"          # Tcl/Tk UI for the git revision control system
brew "tmux"
brew "vim"
brew "zsh"
brew "node"             # Required for Claude Code, Gemini CLI, and Codex CLI (all installed via npm)
brew "python"

# Python toolchain
brew "uv"               # Fast Python package installer (used inside conda envs)

# CLI tools
brew "tree"
brew "wget"
brew "htop"
brew "jq"
brew "bat"              # Better cat with syntax highlighting
brew "fd"               # Better find
brew "eza"              # Better ls (maintained fork of exa)
brew "zoxide"           # Smarter cd command
brew "coreutils"        # GNU File, Shell, and Text utilities
brew "mosh"             # Remote terminal application
brew "pandoc"           # Swiss-army knife of markup format conversion

# Search & navigation
brew "gh"               # GitHub CLI (also used for GitHub Copilot CLI extension)
brew "fzf"              # Fuzzy finder
brew "ripgrep"          # Fast search tool

# Data & analytics
brew "r"                # GNU R statistical computing language
brew "apache-arrow"     # Apache Arrow columnar in-memory analytics
brew "lz4"              # LZ4 extremely fast compression algorithm
brew "thrift"           # Apache Thrift RPC system

# Visualization & documentation
brew "ghostscript"      # PostScript and PDF interpreter
brew "graphviz"         # Graph visualization software
brew "hugo"             # Fast, flexible static site generator
brew "hunspell"         # Spell checker and morphological analyzer

# Development utilities
brew "kubernetes-cli"   # Kubernetes command-line tool
brew "shellcheck"       # Shell script static analysis tool
brew "colima"           # Lightweight container runtime (Docker Desktop alternative)

# Database connectivity
brew "unixodbc"         # ODBC 3 connectivity for UNIX
brew "freetds"          # Libraries to talk to Microsoft SQL Server and Sybase databases

# Cloud & Azure
brew "azure-cli"        # Microsoft Azure CLI 2.0
brew "libomp", link: true  # LLVM's OpenMP runtime library
brew "azure/azd/azd"    # Azure Developer CLI

# Applications
cask "1password"                    # GUI password manager
cask "1password-cli"                # Command-line helper for the 1Password password manager
# adobe-lightroom removed — no longer available as a Homebrew cask; install via Adobe Creative Cloud
cask "bettersnaptool"               # Window snapping and management tool
cask "caffeine"                     # Prevents Mac from sleeping
cask "chatgpt"                      # OpenAI ChatGPT desktop app
cask "claude"                       # Anthropic Claude desktop app
cask "cyberduck"                    # FTP, SFTP, WebDAV, and cloud storage browser
cask "docker"                       # Container platform
cask "firefox"                      # Web browser
cask "github-copilot-for-xcode"     # Xcode extension for GitHub Copilot
cask "google-chrome"                # Primary browser
cask "google-drive"                 # Google Drive cloud storage
cask "hyper"                        # Terminal built on web technologies
cask "miniconda"                    # Minimal installer for conda
cask "nordvpn"                      # VPN client
cask "rstudio"                      # IDE for R programming
cask "sonos"                        # Sonos controller app
cask "virtualbox"                   # VM platform
cask "visual-studio-code-insiders"  # Primary editor
cask "visual-studio-code"           # Secondary editor
cask "warp"                         # Terminal with AI integration
cask "zoom"                         # Video conferencing
cask "zwift"                        # Cycling training game

# VS Code extensions
vscode "anthropic.claude-code"
vscode "astral-sh.ty"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "formulahendry.azure-storage-explorer"
vscode "google.geminicodeassist"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "james-yu.latex-workshop"
vscode "mechatroner.rainbow-csv"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.anaconda-extension-pack"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-ai"
vscode "ms-toolsai.vscode-ai-remote"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-copilot-data-analysis"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-speech"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "snowflake.snowflake-vsc"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tushortz.python-extended-snippets"
vscode "vscode-icons-team.vscode-icons"
vscode "whitphx.vscode-stlite"
