# Taps
tap "homebrew/bundle"

# Development tools
brew "git"
brew "git-lfs"  # Git Large File Storage
brew "tmux"
brew "vim"
brew "zsh"
brew "node"     # Required for Claude Code, Gemini CLI, and Codex CLI
brew "python"

# Python toolchain
brew "uv"       # Fast Python package installer (used inside conda envs)

# CLI tools
brew "tree"
brew "wget"
brew "htop"
brew "jq"
brew "bat"      # Better cat with syntax highlighting
brew "fd"       # Better find
brew "eza"      # Better ls (maintained fork of exa)
brew "zoxide"   # Smarter cd command

# Search & navigation
brew "gh"       # GitHub CLI (also used for GitHub Copilot CLI extension)
brew "fzf"      # Fuzzy finder
brew "ripgrep"  # Fast search tool

# Python development
cask "miniconda"

# Applications
cask "google-chrome"                # Primary browser
cask "visual-studio-code-insiders"  # Primary editor (includes GitHub Copilot)
cask "visual-studio-code"           # Backup editor
cask "docker"
